wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_rcc.h
/*
 *******************************************************************************
    @file     reg_rcc.h
    @author   AE TEAM
    @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE ADC
              FIRMWARE LIBRARY.
 *******************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its
       contributors may be used to endorse or promote products derived from this
       software without specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
    AND ANY EXPRESS OR IMPLIED WARRANTIES,INCLUDING, BUT NOT LIMITED TO,
    THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
    PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
    CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
    EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
    PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
    OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
    OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
    ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/

#ifndef __REG_RCC_H
#define __REG_RCC_H

/* Files includes ------------------------------------------------------------*/
#include <core_cm0.h>
#if 0
/* IP_RCC_DesignSpec_v1.0 */
/* THY  2022/11/25 */
#endif

#ifdef __cplusplus
extern "C" {
#endif

#if defined(__CC_ARM)
#pragma anon_unions
#elif defined(__ICCARM__)
#pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic ignored "-Wc11-extensions"
#pragma clang diagnostic ignored "-Wreserved-id-macro"
#elif defined(__GNUC__)
/* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif

/**
  * @brief RCC Base Address Definition
  */
#define RCC_BASE                        (AHBPERIPH_BASE + 0x1000)               /*!< Base Address: 0x40021000 */

/**
  * @brief RCC Register Structure Definition
  */
typedef struct {
    __IO uint32_t CR;                                                           /*!< Control Register                               offset: 0x00 */
    __IO uint32_t CFGR;                                                         /*!< Configuration Register                         offset: 0x04 */
    __IO uint32_t CIR;                                                          /*!< Clock Interrupt Register                       offset: 0x08 */
    __IO uint32_t APB2RSTR;                                                     /*!< Advanced Peripheral Bus 2 Reset Register       offset: 0x0C */
    __IO uint32_t APB1RSTR;                                                     /*!< Advanced Peripheral Bus 1 Reset Register       offset: 0x10 */
    __IO uint32_t AHBENR;                                                       /*!< Advanced High Performance Bus Enable Register  offset: 0x14 */
    __IO uint32_t APB2ENR;                                                      /*!< Advanced Peripheral Bus 2 Enable Register      offset: 0x18 */
    __IO uint32_t APB1ENR;                                                      /*!< Advanced Peripheral Bus 1 Enable Register      offset: 0x1C */
    __IO uint32_t BDCR;                                                         /*!< Backup domain control register                 offset: 0x20 */
    __IO uint32_t CSR;                                                          /*!< Control Status Register                        offset: 0x24 */
    __IO uint32_t AHBRSTR;                                                      /*!< Advanced High Performance Bus Reset Register   offset: 0x28 */
    __IO uint32_t CFGR2;                                                        /*!< Configuration Register 2                       offset: 0x2C */
    __IO uint32_t RESERVED0x30[4];                                              /*!< Reserved                                       offset: 0x30 */
    __IO uint32_t SYSCFGR;                                                      /*!< System Configuration Register                  offset: 0x40 */
    __IO uint32_t HSIDLY;                                                       /*!< HSI delay Register                             offset: 0x44 */
    __IO uint32_t HSEDLY;                                                       /*!< HSE delay Register                             offset: 0x48 */
    __IO uint32_t ICSCR;                                                        /*!< Internal clock source calibration register     offset: 0x4C */
    __IO uint32_t PLL1CFGR;                                                     /*!< PLL1 Configuration Register                    offset: 0x50 */
    __IO uint32_t PLL2CFGR;                                                     /*!< PLL2 Configuration Register                    offset: 0x54 */
    __IO uint32_t RESERVED0x58[10];                                             /*!< Reserved                                       offset: 0x58 */
    __IO uint32_t RCC_LDOCR;                                                    /*!< LDO Control Register                           offset: 0x80 */
    __IO uint32_t RESERVED0x84;                                                 /*!< Reserved                                       offset: 0x84 */
    __IO uint32_t PLL1DLY;                                                      /*!< PLL1 delay Register                            offset: 0x88 */
    __IO uint32_t PLL2DLY;                                                      /*!< PLL2 delay Register                            offset: 0x8C */
} RCC_TypeDef;

/**
  * @brief RCC type pointer Definition
  */
#define RCC                             ((RCC_TypeDef*) RCC_BASE)

/**
  * @brief RCC_CR Register Bit Definition
  */
#define RCC_CR_HSION_Pos                (0)
#define RCC_CR_HSION                    (0x01U << RCC_CR_HSION_Pos)             /*!< Internal High Speed clock enable */

#define RCC_CR_HSIRDY_Pos               (1)
#define RCC_CR_HSIRDY                   (0x01U << RCC_CR_HSIRDY_Pos)            /*!< Internal High Speed clock ready flag */

#define RCC_CR_HSELPFBYP_Pos            (4)
#define RCC_CR_HSELPFBYP                (0x01U << RCC_CR_HSELPFBYP_Pos)         /*!< LPF_IN direct output */
#define RCC_CR_HSELPFSEL_Pos            (5)
#define RCC_CR_HSELPFSEL                (0x01U << RCC_CR_HSELPFSEL_Pos)         /*!< Output after LPF filtering */
#define RCC_CR_HSEDEGLITCHBYP_Pos       (6)
#define RCC_CR_HSEDEGLITCHBYP           (0x01U << RCC_CR_HSE_DEGLITCHBYP_Pos)   /*!< Bypass deburring function */
#define RCC_CR_HSEDEGLITCHSEL_Pos       (7)
#define RCC_CR_HSEDEGLITCHSEL           (0x01U << RCC_CR_HSE_DEGLITCHSEL_Pos)   /*!< Deburring width 5nS */
#define RCC_CR_HSEOUTPUTSEL_Pos         (8)
#define RCC_CR_HSEOUTPUTSEL             (0x01U << RCC_CR_HSE_OUTPUTSEL_Pos)     /*!< Filtered output */
#define RCC_CR_HSIDIV_Pos               (11)
#define RCC_CR_HSIDIV_1                 (0x00U << RCC_CR_HSIDIV_Pos)            /*!< HSI clock division 1   factor */
#define RCC_CR_HSIDIV_2                 (0x01U << RCC_CR_HSIDIV_Pos)            /*!< HSI clock division 2   factor */
#define RCC_CR_HSIDIV_4                 (0x02U << RCC_CR_HSIDIV_Pos)            /*!< HSI clock division 4   factor */
#define RCC_CR_HSIDIV_8                 (0x03U << RCC_CR_HSIDIV_Pos)            /*!< HSI clock division 8   factor */
#define RCC_CR_HSIDIV_16                (0x04U << RCC_CR_HSIDIV_Pos)            /*!< HSI clock division 16  factor */
#define RCC_CR_HSIDIV_32                (0x05U << RCC_CR_HSIDIV_Pos)            /*!< HSI clock division 32  factor */
#define RCC_CR_HSIDIV_64                (0x06U << RCC_CR_HSIDIV_Pos)            /*!< HSI clock division 64  factor */
#define RCC_CR_HSIDIV_128               (0x07U << RCC_CR_HSIDIV_Pos)            /*!< HSI clock division 128 factor */

