wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_rcc.h
#define RCC_CFGR_USBPRE_Pos             (22)
#define RCC_CFGR_USBPRE                 (0x03U << RCC_CFGR_USBPRE_Pos)          /*!< USB prescaler */
#define RCC_CFGR_USBPRE_DIV1            (0x00U << RCC_CFGR_USBPRE_Pos)          /*!< PLL1/2 clock is directly used as USB clock */
#define RCC_CFGR_USBPRE_DIV2            (0x01U << RCC_CFGR_USBPRE_Pos)          /*!< PLL1/2 clock 2 division as USB clock */
#define RCC_CFGR_USBPRE_DIV3            (0x02U << RCC_CFGR_USBPRE_Pos)          /*!< PLL1/2 clock 3 division as USB clock */
#define RCC_CFGR_USBPRE_DIV4            (0x03U << RCC_CFGR_USBPRE_Pos)          /*!< PLL1/2 clock 4 division as USB clock */

#define RCC_CFGR_MCO_Pos                (24)
#define RCC_CFGR_MCO                    (0x07U << RCC_CFGR_MCO_Pos)             /*!< MCO[2:0] bits (Microcontroller Clock Output) */
#define RCC_CFGR_MCO_NOCLOCK            (0x00U << RCC_CFGR_MCO_Pos)             /*!< No clock */
#define RCC_CFGR_MCO_LSI                (0x02U << RCC_CFGR_MCO_Pos)             /*!< LSI clock */
#define RCC_CFGR_MCO_LSE                (0x03U << RCC_CFGR_MCO_Pos)             /*!< LSE clock */
#define RCC_CFGR_MCO_SYSCLK             (0x04U << RCC_CFGR_MCO_Pos)             /*!< System clock selected */
#define RCC_CFGR_MCO_HSI                (0x05U << RCC_CFGR_MCO_Pos)             /*!< Internal 48 MHz RC oscillator clock selected */
#define RCC_CFGR_MCO_HSE                (0x06U << RCC_CFGR_MCO_Pos)             /*!< External 1-25 MHz oscillator clock selected */
#define RCC_CFGR_MCO_PLL1               (0x07U << RCC_CFGR_MCO_Pos)             /*!< PLL1 clock divided by 2 selected */
#define RCC_CFGR_MCO_PLL1DIV2           (0x07U << RCC_CFGR_MCO_Pos)             /*!< PLL1 clock divided by 2 selected */

/**
  * @brief RCC_CIR Register Bit Definition
  */
#define RCC_CIR_LSIRDYF_Pos             (0)
#define RCC_CIR_LSIRDYF                 (0x01U << RCC_CIR_LSIRDYF_Pos)          /*!< LSI Ready Interrupt flag */

#define RCC_CIR_LSERDYF_Pos             (1)
#define RCC_CIR_LSERDYF                 (0x01U << RCC_CIR_LSERDYF_Pos)          /*!< LSE Ready Interrupt flag */

#define RCC_CIR_HSIRDYF_Pos             (2)
#define RCC_CIR_HSIRDYF                 (0x01U << RCC_CIR_HSIRDYF_Pos)          /*!< HSI Ready Interrupt flag */
#define RCC_CIR_HSERDYF_Pos             (3)
#define RCC_CIR_HSERDYF                 (0x01U << RCC_CIR_HSERDYF_Pos)          /*!< HSE Ready Interrupt flag */

#define RCC_CIR_PLL1RDYF_Pos            (4)
#define RCC_CIR_PLL1RDYF                (0x01U << RCC_CIR_PLL1RDYF_Pos)         /*!< PLL1 Ready Interrupt flag */

#define RCC_CIR_PLL2RDYF_Pos            (5)
#define RCC_CIR_PLL2RDYF                (0x01U << RCC_CIR_PLL2RDYF_Pos)         /*!< PLL2 Ready Interrupt flag */

#define RCC_CIR_CSSF_Pos                (7)
#define RCC_CIR_CSSF                    (0x01U << RCC_CIR_CSSF_Pos)             /*!< Clock Security System Interrupt flag */
#define RCC_CIR_LSIRDYIE_Pos            (8)
#define RCC_CIR_LSIRDYIE                (0x01U << RCC_CIR_LSIRDYIE_Pos)         /*!< LSI Ready Interrupt Enable */

#define RCC_CIR_LSERDYIE_Pos            (9)
#define RCC_CIR_LSERDYIE                (0x01U << RCC_CIR_LSERDYIE_Pos)         /*!< LSE Ready Interrupt Enable */

#define RCC_CIR_HSIRDYIE_Pos            (10)
#define RCC_CIR_HSIRDYIE                (0x01U << RCC_CIR_HSIRDYIE_Pos)         /*!< HSI Ready Interrupt Enable */
#define RCC_CIR_HSERDYIE_Pos            (11)
#define RCC_CIR_HSERDYIE                (0x01U << RCC_CIR_HSERDYIE_Pos)         /*!< HSE Ready Interrupt Enable */

#define RCC_CIR_PLL1RDYIE_Pos           (12)
#define RCC_CIR_PLL1RDYIE               (0x01U << RCC_CIR_PLL1RDYIE_Pos)        /*!< PLL1 Ready Interrupt Enable */

#define RCC_CIR_LSIRDYC_Pos             (16)
#define RCC_CIR_LSIRDYC                 (0x01U << RCC_CIR_LSIRDYC_Pos)          /*!< LSI Ready Interrupt Clear */

#define RCC_CIR_LSERDYC_Pos             (17)
#define RCC_CIR_LSERDYC                 (0x01U << RCC_CIR_LSERDYC_Pos)          /*!< LSE Ready Interrupt Clear */

#define RCC_CIR_HSIRDYC_Pos             (18)
#define RCC_CIR_HSIRDYC                 (0x01U << RCC_CIR_HSIRDYC_Pos)          /*!< HSI Ready Interrupt Clear */
#define RCC_CIR_HSERDYC_Pos             (19)
#define RCC_CIR_HSERDYC                 (0x01U << RCC_CIR_HSERDYC_Pos)          /*!< HSE Ready Interrupt Clear */

#define RCC_CIR_PLL1RDYC_Pos            (20)
#define RCC_CIR_PLL1RDYC                (0x01U << RCC_CIR_PLL1RDYC_Pos)         /*!< PLL1 Ready Interrupt Clear */

#define RCC_CIR_PLL2RDYC_Pos            (21)
#define RCC_CIR_PLL2RDYC                (0x01U << RCC_CIR_PLL2RDYC_Pos)         /*!< PLL2 Ready Interrupt Clear */

#define RCC_CIR_CSSC_Pos                (23)
#define RCC_CIR_CSSC                    (0x01U << RCC_CIR_CSSC_Pos)             /*!< Clock Security System Interrupt Clear */

/**
  * @brief RCC_APB2RSTR Register Bit Definition
  */
#define RCC_APB2RSTR_SYSCFG_Pos         (0)
#define RCC_APB2RSTR_SYSCFG             (0x01U << RCC_APB2RSTR_SYSCFG_Pos)      /*!< System Configuration register reset */

#define RCC_APB2RSTR_ADC_Pos            (9)
#define RCC_APB2RSTR_ADC                (0x01U << RCC_APB2RSTR_ADC_Pos)         /*!< ADC interface reset */

#define RCC_APB2RSTR_TIM1_Pos           (11)
#define RCC_APB2RSTR_TIM1               (0x01U << RCC_APB2RSTR_TIM1_Pos)        /*!< TIM1 Timer reset */

#define RCC_APB2RSTR_SPI1_Pos           (12)
#define RCC_APB2RSTR_SPI1               (0x01U << RCC_APB2RSTR_SPI1_Pos)        /*!< SPI 1 reset */

#define RCC_APB2RSTR_UART1_Pos          (14)
#define RCC_APB2RSTR_UART1              (0x01U << RCC_APB2RSTR_UART1_Pos)       /*!< UART1 reset */

#define RCC_APB2RSTR_CPT_Pos            (15)
#define RCC_APB2RSTR_CPT                (0x01U << RCC_APB2RSTR_CPT_Pos)         /*!< COMP interface reset */

#define RCC_APB2RSTR_TIM14_Pos          (16)
#define RCC_APB2RSTR_TIM14              (0x01U << RCC_APB2RSTR_TIM14_Pos)       /*!< TIM14 Timer reset */

#define RCC_APB2RSTR_TIM16_Pos          (17)
#define RCC_APB2RSTR_TIM16              (0x01U << RCC_APB2RSTR_TIM16_Pos)       /*!< TIM16 Timer reset */

#define RCC_APB2RSTR_TIM17_Pos          (18)
#define RCC_APB2RSTR_TIM17              (0x01U << RCC_APB2RSTR_TIM17_Pos)       /*!< TIM17 Timer reset */

#define RCC_APB2RSTR_DBG_Pos            (22)
#define RCC_APB2RSTR_DBG                (0x01U << RCC_APB2RSTR_DBG_Pos)         /*!< DBG reset */

#define RCC_APB2RSTR_LPTIM_Pos          (30)
#define RCC_APB2RSTR_LPTIM              (0x01U << RCC_APB2RSTR_LPTIM_Pos)       /*!< LPTIM reset */

#define RCC_APB2RSTR_LPUART_Pos         (31)
#define RCC_APB2RSTR_LPUART             (0x01U << RCC_APB2RSTR_LPUART_Pos)      /*!< LPUART reset */

/**
  * @brief RCC_APB1RSTR Register Bit Definition
  */
#define RCC_APB1RSTR_TIM2_Pos           (0)
#define RCC_APB1RSTR_TIM2               (0x01U << RCC_APB1RSTR_TIM2_Pos)        /*!< Timer 2 reset */

#define RCC_APB1RSTR_TIM3_Pos           (1)
#define RCC_APB1RSTR_TIM3               (0x01U << RCC_APB1RSTR_TIM3_Pos)        /*!< Timer 3 reset */

#define RCC_APB1RSTR_I3C_Pos            (6)
#define RCC_APB1RSTR_I3C                (0x01U << RCC_APB1RSTR_I3C_Pos)         /*!< I3C reset */

