wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_rcc.h
#define RCC_APB1RSTR_WWDG_Pos           (11)
#define RCC_APB1RSTR_WWDG               (0x01U << RCC_APB1RSTR_WWDG_Pos)        /*!< Window Watchdog reset */

#define RCC_APB1RSTR_SPI2_Pos           (14)
#define RCC_APB1RSTR_SPI2               (0x01U << RCC_APB1RSTR_SPI2_Pos)        /*!< SPI 2 reset */

#define RCC_APB1RSTR_UART2_Pos          (17)
#define RCC_APB1RSTR_UART2              (0x01U << RCC_APB1RSTR_UART2_Pos)       /*!< UART 2 reset */
#define RCC_APB1RSTR_UART3_Pos          (18)
#define RCC_APB1RSTR_UART3              (0x01U << RCC_APB1RSTR_UART3_Pos)       /*!< UART 3 reset */
#define RCC_APB1RSTR_UART4_Pos          (19)
#define RCC_APB1RSTR_UART4              (0x01U << RCC_APB1RSTR_UART4_Pos)       /*!< UART 4 reset */
#define RCC_APB1RSTR_I2C1_Pos           (21)
#define RCC_APB1RSTR_I2C1               (0x01U << RCC_APB1RSTR_I2C1_Pos)        /*!< I2C 1 reset */

#define RCC_APB1RSTR_BKP_Pos            (24)
#define RCC_APB1RSTR_BKP                (0x01U << RCC_APB1RSTR_BKP_Pos)         /*!< BKP reset */

#define RCC_APB1RSTR_FLEXCAN_Pos        (25)
#define RCC_APB1RSTR_FLEXCAN            (0x01U << RCC_APB1RSTR_FLEXCAN_Pos)     /*!< FLEXCAN reset */

#define RCC_APB1RSTR_CRS_Pos            (27)
#define RCC_APB1RSTR_CRS                (0x01U << RCC_APB1RSTR_CRS_Pos)         /*!< CRS reset */

#define RCC_APB1RSTR_PWR_Pos            (28)
#define RCC_APB1RSTR_PWR                (0x01U << RCC_APB1RSTR_PWR_Pos)         /*!< Power interface reset */

#define RCC_APB1RSTR_RTC_Pos            (31)
#define RCC_APB1RSTR_RTC                (0x01U << RCC_APB1RSTR_RTC_Pos)         /*!< RTC reset */

/**
  * @brief RCC_AHBENR Register Bit Definition
  */
#define RCC_AHBENR_DMA_Pos              (0)
#define RCC_AHBENR_DMA                  (0x01U << RCC_AHBENR_DMA_Pos)           /*!< DMA clock enable */
#define RCC_AHBENR_SRAM_Pos             (2)
#define RCC_AHBENR_SRAM                 (0x01U << RCC_AHBENR_SRAM_Pos)          /*!< SRAM interface clock enable */
#define RCC_AHBENR_FLASH_Pos            (4)
#define RCC_AHBENR_FLASH                (0x01U << RCC_AHBENR_FLASH_Pos)         /*!< FLASH clock enable */
#define RCC_AHBENR_CRC_Pos              (6)
#define RCC_AHBENR_CRC                  (0x01U << RCC_AHBENR_CRC_Pos)           /*!< Internal High Speed clock Calibration */

#define RCC_AHBENR_GPIOA_Pos            (17)
#define RCC_AHBENR_GPIOA                (0x01U << RCC_AHBENR_GPIOA_Pos)         /*!< GPIOA clock enable */
#define RCC_AHBENR_GPIOB_Pos            (18)
#define RCC_AHBENR_GPIOB                (0x01U << RCC_AHBENR_GPIOB_Pos)         /*!< GPIOB clock enable */
#define RCC_AHBENR_GPIOC_Pos            (19)
#define RCC_AHBENR_GPIOC                (0x01U << RCC_AHBENR_GPIOC_Pos)         /*!< GPIOC clock enable */
#define RCC_AHBENR_GPIOD_Pos            (20)
#define RCC_AHBENR_GPIOD                (0x01U << RCC_AHBENR_GPIOD_Pos)         /*!< GPIOD clock enable */

#define RCC_AHBENR_USB_Pos              (24)
#define RCC_AHBENR_USB                  (0x01U << RCC_AHBENR_USB_Pos)           /*!< USB clock enable */

#define RCC_AHBENR_HWDIV_Pos            (26)
#define RCC_AHBENR_HWDIV                (0x01U << RCC_AHBENR_HWDIV_Pos)         /*!< HWDIV clock enable */

/**
  * @brief RCC_APB2ENR Register Bit Definition
  */
#define RCC_APB2ENR_SYSCFG_Pos          (0)
#define RCC_APB2ENR_SYSCFG              (0x01U << RCC_APB2ENR_SYSCFG_Pos)       /*!< SYSCFG Block enable */
#define RCC_APB2ENR_ADC_Pos             (9)
#define RCC_APB2ENR_ADC                 (0x01U << RCC_APB2ENR_ADC_Pos)          /*!< ADC interface clock enable */

#define RCC_APB2ENR_TIM1_Pos            (11)
#define RCC_APB2ENR_TIM1                (0x01U << RCC_APB2ENR_TIM1_Pos)         /*!< TIM1 Timer clock enable */
#define RCC_APB2ENR_SPI1_Pos            (12)
#define RCC_APB2ENR_SPI1                (0x01U << RCC_APB2ENR_SPI1_Pos)         /*!< SPI 1 clock enable */
#define RCC_APB2ENR_UART1_Pos           (14)
#define RCC_APB2ENR_UART1               (0x01U << RCC_APB2ENR_UART1_Pos)        /*!< UART1 clock ena */
#define RCC_APB2ENR_COMP_Pos            (15)
#define RCC_APB2ENR_COMP                (0x01U << RCC_APB2ENR_COMP_Pos)         /*!< Comparator interface clock enable */

#define RCC_APB2ENR_TIM14_Pos           (16)
#define RCC_APB2ENR_TIM14               (0x01U << RCC_APB2ENR_TIM14_Pos)        /*!< TIM14 Timer clock enable */

#define RCC_APB2ENR_TIM16_Pos           (17)
#define RCC_APB2ENR_TIM16               (0x01U << RCC_APB2ENR_TIM16_Pos)        /*!< TIM16 Timer clock enable */
#define RCC_APB2ENR_TIM17_Pos           (18)
#define RCC_APB2ENR_TIM17               (0x01U << RCC_APB2ENR_TIM17_Pos)        /*!< TIM17 Timer clock enable */
#define RCC_APB2ENR_DBG_Pos             (22)
#define RCC_APB2ENR_DBG                 (0x01U << RCC_APB2ENR_DBG_Pos)          /*!< DBG clock enable */
#define RCC_APB2ENR_EXTI_Pos            (29)
#define RCC_APB2ENR_EXTI                (0x01U << RCC_APB2ENR_EXTI_Pos)         /*!< EXTI Block enable */
#define RCC_APB2ENR_LPTIM_Pos           (30)
#define RCC_APB2ENR_LPTIM               (0x01U << RCC_APB2ENR_LPTIM_Pos)        /*!< LPTIM Block enable */
#define RCC_APB2ENR_LPUART_Pos          (31)
#define RCC_APB2ENR_LPUART              (0x01U << RCC_APB2ENR_LPUART_Pos)       /*!< LPUART Block enable */

/**
  * @brief RCC_APB1ENR Register Bit Definition
  */
#define RCC_APB1ENR_TIM2_Pos            (0)
#define RCC_APB1ENR_TIM2                (0x01U << RCC_APB1ENR_TIM2_Pos)         /*!< Timer 2 clock enable */

#define RCC_APB1ENR_TIM3_Pos            (1)
#define RCC_APB1ENR_TIM3                (0x01U << RCC_APB1ENR_TIM3_Pos)         /*!< Timer 3 clock enabled */

#define RCC_APB1ENR_I3C_Pos             (6)
#define RCC_APB1ENR_I3C                 (0x01U << RCC_APB1ENR_I3C_Pos)          /*!< I3C clock enabled */

#define RCC_APB1ENR_WWDG_Pos            (11)
#define RCC_APB1ENR_WWDG                (0x01U << RCC_APB1ENR_WWDG_Pos)         /*!< Window Watchdog clock enable */

#define RCC_APB1ENR_SPI2_Pos            (14)
#define RCC_APB1ENR_SPI2                (0x01U << RCC_APB1ENR_SPI2_Pos)         /*!< SPI 2 clock enable */

#define RCC_APB1ENR_UART2_Pos           (17)
#define RCC_APB1ENR_UART2               (0x01U << RCC_APB1ENR_UART2_Pos)        /*!< UART 2 clock enable */

