wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_rcc.h
#define RCC_APB1ENR_UART3_Pos           (18)
#define RCC_APB1ENR_UART3               (0x01U << RCC_APB1ENR_UART3_Pos)        /*!< UART 3 clock enable */

#define RCC_APB1ENR_UART4_Pos           (19)
#define RCC_APB1ENR_UART4               (0x01U << RCC_APB1ENR_UART4_Pos)        /*!< UART 4 clock enable */

#define RCC_APB1ENR_I2C1_Pos            (21)
#define RCC_APB1ENR_I2C1                (0x01U << RCC_APB1ENR_I2C1_Pos)         /*!< I2C 1 clock enable */

#define RCC_APB1ENR_BKP_Pos             (24)
#define RCC_APB1ENR_BKP                 (0x01U << RCC_APB1ENR_BKP_Pos)          /*!< BKP interface clock enable */

#define RCC_APB1ENR_FLEXCAN_Pos         (25)
#define RCC_APB1ENR_FLEXCAN             (0x01U << RCC_APB1ENR_FLEXCAN_Pos)      /*!< FLEXCAN clock enable */

#define RCC_APB1ENR_CRS_Pos             (27)
#define RCC_APB1ENR_CRS                 (0x01U << RCC_APB1ENR_CRS_Pos)          /*!< CRS clock enable */

#define RCC_APB1ENR_PWR_Pos             (28)
#define RCC_APB1ENR_PWR                 (0x01U << RCC_APB1ENR_PWR_Pos)          /*!< Power clock enable */
#define RCC_APB1ENR_IWDG_Pos            (30)
#define RCC_APB1ENR_IWDG                (0x01U << RCC_APB1ENR_IWDG_Pos)         /*!< IWDG clock enable */
#define RCC_APB1ENR_RTC_Pos             (31)
#define RCC_APB1ENR_RTC                 (0x01U << RCC_APB1ENR_RTC_Pos)          /*!< RTC clock enable */

/**
  * @brief RCC_BDCR Register Bit Definition
  */
#define RCC_BDCR_LSEON_Pos              (0)
#define RCC_BDCR_LSEON_Msk              (0x01U << RCC_BDCR_LSEON_Pos)           /*!< External low-speed oscillator enable */
#define RCC_BDCR_LSERDY_Pos             (1)
#define RCC_BDCR_LSERDY                 (0x01U << RCC_BDCR_LSERDY_Pos)          /*!< External low-speed oscillator ready */
#define RCC_BDCR_LSEBYP_Pos             (2)
#define RCC_BDCR_LSEBYP_Msk             (0x01U << RCC_BDCR_LSEBYP_Pos)          /*!< External low-speed oscillator bypass */
#define RCC_BDCR_RTCSEL_Pos             (8)
#define RCC_BDCR_RTCSEL                 (0x03U << RCC_BDCR_RTCSEL_Pos)          /*!< RTC clock source selection */
#define RCC_BDCR_RTCSEL_NONE            (0x00U << RCC_BDCR_RTCSEL_Pos)          /*!< No clock */
#define RCC_BDCR_RTCSEL_LSE             (0x01U << RCC_BDCR_RTCSEL_Pos)          /*!< LSE oscillator used as RTC clock */
#define RCC_BDCR_RTCSEL_LSI             (0x02U << RCC_BDCR_RTCSEL_Pos)          /*!< LSI oscillator used as RTC clock */
#define RCC_BDCR_RTCSEL_HSE             (0x03U << RCC_BDCR_RTCSEL_Pos)          /*!< HSE oscillator is used as RTC clock after 128 frequency division */
#define RCC_BDCR_RTCEN_Pos              (15)
#define RCC_BDCR_RTCEN                  (0x01U << RCC_BDCR_RTCEN_Pos)           /*!< RTC clock enable */
#define RCC_BDCR_BDRST_Pos              (16)
#define RCC_BDCR_BDRST                  (0x01U << RCC_BDCR_BDRST_Pos)           /*!< Backup domain software reset */
#define RCC_BDCR_DBP_Pos                (24)
#define RCC_BDCR_DBP                    (0x01U << RCC_BDCR_DBP_Pos)             /*!< Allow access to RTC and backing registers */

/**
  * @brief RCC_CSR Register Bit Definition
  */
#define RCC_CSR_LSION_Pos               (0)
#define RCC_CSR_LSION                   (0x01U << RCC_CSR_LSION_Pos)            /*!< Internal Low Speed oscillator enable */
#define RCC_CSR_LSIRDY_Pos              (1)
#define RCC_CSR_LSIRDY                  (0x01U << RCC_CSR_LSIRDY_Pos)           /*!< Internal Low Speed oscillator ready */
#define RCC_CSR_LSIOE_Pos               (5)
#define RCC_CSR_LSIOE                   (0x01U << RCC_CSR_LSIOE_Pos)            /*!< LSI Output Enable */
#define RCC_CSR_PVDRSTEN_Pos            (6)
#define RCC_CSR_PVDRSTEN                (0x01U << RCC_CSR_PVDRSTEN_Pos)         /*!< PVD reset enable */
#define RCC_CSR_LOCKUPEN_Pos            (7)
#define RCC_CSR_LOCKUPEN                (0x01U << RCC_CSR_LOCKUPEN_Pos)         /*!< CPU Lockup reset enable */

#define RCC_CSR_PVDRSTF_Pos             (22)
#define RCC_CSR_PVDRSTF                 (0x01U << RCC_CSR_PVDRSTF_Pos)          /*!< PVD reset flag */
#define RCC_CSR_LOCKUPF_Pos             (23)
#define RCC_CSR_LOCKUPF                 (0x01U << RCC_CSR_LOCKUPF_Pos)          /*!< CPU lockup reset flag */

#define RCC_CSR_RMVF_Pos                (24)
#define RCC_CSR_RMVF                    (0x01U << RCC_CSR_RMVF_Pos)             /*!< Remove reset flag */
#define RCC_CSR_PINRSTF_Pos             (26)
#define RCC_CSR_PINRSTF                 (0x01U << RCC_CSR_PINRSTF_Pos)          /*!< PIN reset flag */

#define RCC_CSR_PORRSTF_Pos             (27)
#define RCC_CSR_PORRSTF                 (0x01U << RCC_CSR_PORRSTF_Pos)          /*!< POR/PDR reset flag */

#define RCC_CSR_SFTRSTF_Pos             (28)
#define RCC_CSR_SFTRSTF                 (0x01U << RCC_CSR_SFTRSTF_Pos)          /*!< Software Reset flag */

#define RCC_CSR_IWDGRSTF_Pos            (29)
#define RCC_CSR_IWDGRSTF                (0x01U << RCC_CSR_IWDGRSTF_Pos)         /*!< Independent Watchdog reset flag */

#define RCC_CSR_WWDGRSTF_Pos            (30)
#define RCC_CSR_WWDGRSTF                (0x01U << RCC_CSR_WWDGRSTF_Pos)         /*!< Window watchdog reset flag */
#define RCC_CSR_LPWRRSTF_Pos            (31)
#define RCC_CSR_LPWRRSTF                (0x01U << RCC_CSR_LPWRRSTF_Pos)         /*!< Low power reset flag */

/**
  * @brief RCC_AHBRSTR Register Bit Definition
  */
#define RCC_AHBRSTR_DMA_Pos             (0)
#define RCC_AHBRSTR_DMA                 (0x01U << RCC_AHBRSTR_DMA_Pos)          /*!< DMA clock reset */
#define RCC_AHBRSTR_CRC_Pos             (6)
#define RCC_AHBRSTR_CRC                 (0x01U << RCC_AHBRSTR_CRC_Pos)          /*!< CRC clock reset */
#define RCC_AHBRSTR_GPIOA_Pos           (17)
#define RCC_AHBRSTR_GPIOA               (0x01U << RCC_AHBRSTR_GPIOA_Pos)        /*!< GPIOA clock reset */
#define RCC_AHBRSTR_GPIOB_Pos           (18)
#define RCC_AHBRSTR_GPIOB               (0x01U << RCC_AHBRSTR_GPIOB_Pos)        /*!< GPIOB clock reset */
#define RCC_AHBRSTR_GPIOC_Pos           (19)
#define RCC_AHBRSTR_GPIOC               (0x01U << RCC_AHBRSTR_GPIOC_Pos)        /*!< GPIOC clock reset */
#define RCC_AHBRSTR_GPIOD_Pos           (20)
#define RCC_AHBRSTR_GPIOD               (0x01U << RCC_AHBRSTR_GPIOD_Pos)        /*!< GPIOD clock reset */
#define RCC_AHBRSTR_USB_Pos             (24)
#define RCC_AHBRSTR_USB                 (0x01U << RCC_AHBRSTR_USB_Pos)          /*!< USB clock reset */
#define RCC_AHBRSTR_DIVIDER_Pos         (26)
#define RCC_AHBRSTR_DIVIDER             (0x01U << RCC_AHBRSTR_DIVIDER_Pos)      /*!< DIVIDER clock reset */

/**
  * @brief RCC_CFGR2 Register Bit Definition
  */
#define RCC_CFGR2_LPUART_CLKSEL_Pos     (0)
#define RCC_CFGR2_LPUART_CLKSEL         (0x03U << RCC_CFGR2_LPUART_CLKSEL_Pos)      /*!< LPUART clock source selection */
#define RCC_CFGR2_LPUART_CLKSEL_LSE     (0x00U << RCC_CFGR2_LPUART_CLKSEL_Pos)      /*!< LSE (default) */
#define RCC_CFGR2_LPUART_CLKSEL_LSI     (0x01U << RCC_CFGR2_LPUART_CLKSEL_Pos)      /*!< LSI */
#define RCC_CFGR2_LPUART_CLKSEL_PCLK_LPUART (0x02U << RCC_CFGR2_LPUART_CLKSEL_Pos)  /*!< PCLK_LPUART */
#define RCC_CFGR2_LPUART_CLKSEL_NONE    (0x03U << RCC_CFGR2_LPUART_CLKSEL_Pos)      /*!< No clock */

