wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/Include/reg_rcc.h
#define RCC_CFGR2_CAN_CLKSEL_Pos        (8)
#define RCC_CFGR2_CAN_CLKSEL            (0x03U << RCC_CFGR2_CAN_CLKSEL_Pos)     /*!< CANPE clock source selection */
#define RCC_CFGR2_CAN_CLKSEL_PLL1       (0x00U << RCC_CFGR2_CAN_CLKSEL_Pos)     /*!< PLL1(default) */
#define RCC_CFGR2_CAN_CLKSEL_PLL2       (0x01U << RCC_CFGR2_CAN_CLKSEL_Pos)     /*!< PLL2 */
#define RCC_CFGR2_CAN_CLKSEL_HSE        (0x02U << RCC_CFGR2_CAN_CLKSEL_Pos)     /*!< HSE */
#define RCC_CFGR2_CAN_CLKSEL_NONE       (0x03U << RCC_CFGR2_CAN_CLKSEL_Pos)     /*!< NO clock */

#define RCC_CFGR2_CANPRE_Pos            (12)
#define RCC_CFGR2_CANPRE                (0x03U << RCC_CFGR2_CANPRE_Pos)         /*!< CANPE clock division */
#define RCC_CFGR2_CANPRE_DIV1           (0x00U << RCC_CFGR2_CANPRE_Pos)         /*!< No frequency division (default) */
#define RCC_CFGR2_CANPRE_DIV2           (0x01U << RCC_CFGR2_CANPRE_Pos)         /*!< 2 Frequency division */
#define RCC_CFGR2_CANPRE_DIV3           (0x02U << RCC_CFGR2_CANPRE_Pos)         /*!< 3 Frequency division */
#define RCC_CFGR2_CANPRE_DIV4           (0x03U << RCC_CFGR2_CANPRE_Pos)         /*!< 4 Frequency division */

#define RCC_CFGR2_APB1_CLK_HV_PRE_POS   (16)
#define RCC_CFGR2_APB1_CLK_HV_PRE       (0x0FU << RCC_CFGR2_APB1_CLK_HV_PRE_POS)    /*!< APB1_HV output clock frequency division coefficient */
#define RCC_CFGR2_APB1_CLK_HV_PRE_8     (0x03U << RCC_CFGR2_APB1_CLK_HV_PRE_POS)    /*!< 8  frequency division */
#define RCC_CFGR2_APB1_CLK_HV_PRE_10    (0x04U << RCC_CFGR2_APB1_CLK_HV_PRE_POS)    /*!< 10 frequency division */
#define RCC_CFGR2_APB1_CLK_HV_PRE_12    (0x05U << RCC_CFGR2_APB1_CLK_HV_PRE_POS)    /*!< 12 frequency division */
#define RCC_CFGR2_APB1_CLK_HV_PRE_14    (0x06U << RCC_CFGR2_APB1_CLK_HV_PRE_POS)    /*!< 14 frequency division */
#define RCC_CFGR2_APB1_CLK_HV_PRE_16    (0x07U << RCC_CFGR2_APB1_CLK_HV_PRE_POS)    /*!< 16 frequency division */
#define RCC_CFGR2_APB1_CLK_HV_PRE_18    (0x08U << RCC_CFGR2_APB1_CLK_HV_PRE_POS)    /*!< 18 frequency division */
#define RCC_CFGR2_APB1_CLK_HV_PRE_20    (0x09U << RCC_CFGR2_APB1_CLK_HV_PRE_POS)    /*!< 20 frequency division */
#define RCC_CFGR2_APB1_CLK_HV_PRE_22    (0x0AU << RCC_CFGR2_APB1_CLK_HV_PRE_POS)    /*!< 22 frequency division */
#define RCC_CFGR2_APB1_CLK_HV_PRE_24    (0x0BU << RCC_CFGR2_APB1_CLK_HV_PRE_POS)    /*!< 24 frequency division */
#define RCC_CFGR2_APB1_CLK_HV_PRE_26    (0x0CU << RCC_CFGR2_APB1_CLK_HV_PRE_POS)    /*!< 26 frequency division */
#define RCC_CFGR2_APB1_CLK_HV_PRE_28    (0x0DU << RCC_CFGR2_APB1_CLK_HV_PRE_POS)    /*!< 28 frequency division */
#define RCC_CFGR2_APB1_CLK_HV_PRE_30    (0x0EU << RCC_CFGR2_APB1_CLK_HV_PRE_POS)    /*!< 30 frequency division */
#define RCC_CFGR2_APB1_CLK_HV_PRE_32    (0x0FU << RCC_CFGR2_APB1_CLK_HV_PRE_POS)    /*!< 32 frequency division */

#define RCC_CFGR2_MCOPRE_Pos            (20)
#define RCC_CFGR2_MCOPRE_1              (0x00U << RCC_CFGR2_MCOPRE_Pos)         /*!< MCO 1   frequency division */
#define RCC_CFGR2_MCOPRE_2              (0x08U << RCC_CFGR2_MCOPRE_Pos)         /*!< MCO 2   frequency division */
#define RCC_CFGR2_MCOPRE_4              (0x09U << RCC_CFGR2_MCOPRE_Pos)         /*!< MCO 4   frequency division */
#define RCC_CFGR2_MCOPRE_8              (0x0AU << RCC_CFGR2_MCOPRE_Pos)         /*!< MCO 8   frequency division */
#define RCC_CFGR2_MCOPRE_16             (0x0BU << RCC_CFGR2_MCOPRE_Pos)         /*!< MCO 16  frequency division */
#define RCC_CFGR2_MCOPRE_64             (0x0CU << RCC_CFGR2_MCOPRE_Pos)         /*!< MCO 64  frequency division */
#define RCC_CFGR2_MCOPRE_128            (0x0DU << RCC_CFGR2_MCOPRE_Pos)         /*!< MCO 128 frequency division */
#define RCC_CFGR2_MCOPRE_256            (0x0EU << RCC_CFGR2_MCOPRE_Pos)         /*!< MCO 256 frequency division */
#define RCC_CFGR2_MCOPRE_512            (0x0FU << RCC_CFGR2_MCOPRE_Pos)         /*!< MCO 512 frequency division */

#define RCC_CFGR2_LPTIM_CLKSEL_Pos      (29)
#define RCC_CFGR2_LPTIM_CLKSEL          (0x03U << RCC_CFGR2_LPTIM_CLKSEL_Pos)      /*!< LPTIM clock source selection */
#define RCC_CFGR2_LPTIM_CLKSEL_LSE      (0x00U << RCC_CFGR2_LPTIM_CLKSEL_Pos)      /*!< LSE (default) */
#define RCC_CFGR2_LPTIM_CLKSEL_LSI      (0x01U << RCC_CFGR2_LPTIM_CLKSEL_Pos)      /*!< LSI */
#define RCC_CFGR2_LPTIM_CLKSEL_PCLK_LPTIMER (0x02U << RCC_CFGR2_LPTIM_CLKSEL_Pos)  /*!< PCLK_LPTIMER */
#define RCC_CFGR2_LPTIM_CLKSEL_NONE     (0x03U << RCC_CFGR2_LPTIM_CLKSEL_Pos)      /*!< No clock */

/**
  * @brief RCC_SYSCFG Register Bit Definition
  */
#define RCC_SYSCFG_PROG_CHECK_EN_Pos    (0)
#define RCC_SYSCFG_PROG_CHECK_EN        (0x01U << RCC_SYSCFG_PROG_CHECK_EN_Pos) /*!< Whether to check the number in Flash when writing to Flash */
#define RCC_SYSCFG_HSE_RFB_SEL_Pos      (8)
#define RCC_SYSCFG_HSE_RFB_SEL          (0x03U << RCC_SYSCFG_HSE_RFB_SELPos)    /*!< Feedback resistance selection */
#define RCC_SYSCFG_HSE_RFB_SEL_2M       (0x00U << RCC_SYSCFG_HSE_RFB_SELPos)    /*!< 2M */
#define RCC_SYSCFG_HSE_RFB_SEL_1M       (0x01U << RCC_SYSCFG_HSE_RFB_SELPos)    /*!< 1M */
#define RCC_SYSCFG_HSE_RFB_SEL_500K     (0x02U << RCC_SYSCFG_HSE_RFB_SELPos)    /*!< 500K */
#define RCC_SYSCFG_HSE_RFB_SEL_200K     (0x03U << RCC_SYSCFG_HSE_RFB_SELPos)    /*!< 200K */

#define RCC_SYSCFG_HSELPFEN_Pos         (14)
#define RCC_SYSCFG_HSELPFEN             (0x01U << RCC_SYSCFG_HSELPFEN_Pos)      /*!< Oscillator low pass filtering enable */

/**
  * @brief RCC_HSIDLY Register Bit Definition
  */
#define RCC_HSIDLY_HSI_EQU_CNT_Pos      (0)
#define RCC_HSIDLY_HSI_EQU_CNT          (0xFFU << RCC_HSIDLY_HSI_EQU_CNT_Pos)   /*!< HSI Delay Time */

/**
  * @brief RCC_HSEDLY Register Bit Definition
  */
#define RCC_HSEDLY_HSE_EQU_CNT_Pos      (0)
#define RCC_HSEDLY_HSE_EQU_CNT          (0xFFU << RCC_HSEDLY_HSE_EQU_CNT_Pos)   /*!< HSE Delay Time */

/**
  * @brief RCC_ICSCR Register Bit Definition
  */
#define RCC_ICSCR_TRIM_CRS_SEL_Pos      (0)
#define RCC_ICSCR_TRIM_CRS_SEL          (0x01U << RCC_ICSCR_TRIM_CRS_SEL_Pos)   /*!< Whether the HSITRIM value uses the CRS module as the source */
#define RCC_ICSCR_HSI_CAL_SEL_Pos       (11)
#define RCC_ICSCR_HSI_CAL_SEL           (0x1FU << RCC_ICSCR_HSI_CAL_SEL_Pos)    /*!< Select the value of register HSICAL */
#define RCC_ICSCR_HSI_CAL_SFT_Pos       (16)
#define RCC_ICSCR_HSI_CAL_SFT           (0x1FU << RCC_ICSCR_HSI_CAL_SFT_Pos)    /*!< Select the value of register HSICAL */

/**
  * @brief RCC_PLL1CFGR Register Bit Definition
  */
#define RCC_PLL1CFGR_PLL1SRC_Pos        (0)
#define RCC_PLL1CFGR_PLL1SRC            (0x01U << RCC_PLL1CFGR_PLL1SRC_Pos)     /*!< HSE as PLL1 entry clock */
#define RCC_PLL1CFGR_PLL1XTPRE_Pos      (1)
#define RCC_PLL1CFGR_PLL1XTPRE          (0x01U << RCC_PLL1CFGR_PLL1XTPRE_Pos)   /*!< HSE frequency division for PLL1 entry */
#define RCC_PLL1CFGR_PLL1_ICTRL_Pos     (2)
#define RCC_PLL1CFGR_PLL1_ICTRL         (0x03U << RCC_PLL1CFGR_PLL1_ICTRL_Pos)  /*!< PLL1 CP current control signals mask */
#define RCC_PLL1CFGR_PLL1_LDS_Pos       (4)
#define RCC_PLL1CFGR_PLL1_LDS           (0x03U << RCC_PLL1CFGR_PLL1_LDS_Pos)    /*!< PLL1 LOCK DETECTOR ACCURACY SELECT */
#define RCC_PLL1CFGR_PLL1DIV_Pos        (8)
#define RCC_PLL1CFGR_PLL1DIV            (0x07U << RCC_PLL1CFGR_PLL1DIV_Pos)     /*!< PLL1?Divide?Factor */
#define RCC_PLL1CFGR_PLL1MUL_Pos        (16)
#define RCC_PLL1CFGR_PLL1MUL            (0xFFU << RCC_PLL1CFGR_PLL1MUL_Pos)     /*!< PLL1?Multiplication?Factor */
#define RCC_PLL1CFGR_PLL1PDIV_Pos       (29)
#define RCC_PLL1CFGR_PLL1PDIV           (0x07U << RCC_PLL1CFGR_PLL1PDIV_Pos)    /*!< PLL1?Pre-divider?Factor */

/**
  * @brief RCC_PLL2CFGR Register Bit Definition
  */
#define RCC_PLL2CFGR_PLL2SRC_Pos        (0)
#define RCC_PLL2CFGR_PLL2SRC            (0x01U << RCC_PLL2CFGR_PLL2SRC_Pos)     /*!< HSE as PLL2 entry clock */
#define RCC_PLL2CFGR_PLL2XTPRE_Pos      (1)
#define RCC_PLL2CFGR_PLL2XTPRE          (0x01U << RCC_PLL2CFGR_PLL2XTPRE_Pos)   /*!< HSE frequency division for PLL2 entry */
#define RCC_PLL2CFGR_PLL2_ICTRL_Pos     (2)
#define RCC_PLL2CFGR_PLL2_ICTRL         (0x03U << RCC_PLL2CFGR_PLL2_ICTRL_Pos)  /*!< PLL2 CP current control signals mask */
#define RCC_PLL2CFGR_PLL2_LDS_Pos       (4)
#define RCC_PLL2CFGR_PLL2_LDS           (0x03U << RCC_PLL2CFGR_PLL2_LDS_Pos)    /*!< PLL2 LOCK DETECTOR ACCURACY SELECT */
#define RCC_PLL2CFGR_PLL2DIV_Pos        (8)
#define RCC_PLL2CFGR_PLL2DIV            (0x07U << RCC_PLL2CFGR_PLL2DIV_Pos)     /*!< PLL2?Divide?Factor */
#define RCC_PLL2CFGR_PLL2MUL_Pos        (16)
#define RCC_PLL2CFGR_PLL2MUL            (0xFFU << RCC_PLL2CFGR_PLL2MUL_Pos)     /*!< PLL2?Multiplication?Factor */
#define RCC_PLL2CFGR_PLL2PDIV_Pos       (29)
#define RCC_PLL2CFGR_PLL2PDIV           (0x07U << RCC_PLL2CFGR_PLL2PDIV_Pos)    /*!< PLL2?Pre-divider?Factor */

/**
  * @brief RCC_LDOCR Register Bit Definition
  */
#define RCC_LDOCR_LDO_TRIM_SEL_Pos      (11)
#define RCC_LDOCR_LDO_TRIM_SEL          (0x1FU << RCC_LDOCR_LDO_TRIM_SEL_Pos)   /*!< Judge LDOTRIM value as LDO Trim value */

#define RCC_LDOCR_LDO_TRIM_Pos          (16)
#define RCC_LDOCR_LDO_TRIM              (0x0FU << RCC_LDOCR_LDO_TRIM_Pos)       /*!< LDOTRIM value */

/**
  * @brief RCC_PLL1DLY Register Bit Definition
  */
#define RCC_PLL1DLY_EQU_CNT_Pos         (0)
#define RCC_PLL1DLY_EQU_CNT             (0x03FFU << RCC_PLL1DLY_EQU_CNT_Pos)    /*!< PLL1 delay time */

/**
  * @brief RCC_PLLDLY Register Bit Definition
  */
#define RCC_PLL2DLY_EQU_CNT_Pos         (0)
#define RCC_PLL2DLY_EQU_CNT             (0x03FFU << RCC_PLL2DLY_EQU_CNT_Pos)    /*!< PLL2 delay time */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

/*----------------------------------------------------------------------------*/
#endif
/*----------------------------------------------------------------------------*/
